
## Plan Result (feature-flags-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/6614)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_s3_bucket_acl.code-pipeline_code-bucket-acl_E38AD0A4
  * aws_s3_bucket_ownership_controls.code-pipeline_code-bucket-ownership-controls_9B2EAFEB
  * local_file.application_ecs_service_appspec_94386B9C
* Replace
  * null_resource.application_ecs_service_create-task-definition-file_6BADBAF7


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket_acl.code-pipeline_code-bucket-acl_E38AD0A4 will be created
  + resource "aws_s3_bucket_acl" "code-pipeline_code-bucket-acl_E38AD0A4" {
      + acl    = "private"
      + bucket = "pocket-codepipeline-e4556474284c8246922a6d5daa376b47"
      + id     = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.code-pipeline_code-bucket-ownership-controls_9B2EAFEB will be created
  + resource "aws_s3_bucket_ownership_controls" "code-pipeline_code-bucket-ownership-controls_9B2EAFEB" {
      + bucket = "pocket-codepipeline-e4556474284c8246922a6d5daa376b47"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4242
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod:281"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.application_ecs_service_create-task-definition-file_6BADBAF7 must be replaced
-/+ resource "null_resource" "application_ecs_service_create-task-definition-file_6BADBAF7" {
      ~ id       = "212618583672820604" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "alwaysRun" = "2023-11-29T18:40:57Z" -> (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"d2d233a3-2036-4ae1-a993-4f0b98c37ebc","JobName":"feature-flags_infrastructure_plan_prod","PRNumber":43,"Program":"tfcmt","SHA1":"db689ab70cab263b5e6e74c3b36ec2845b77ca3d","Target":"feature-flags-cdk","Vars":{}} -->